import React, { useState, useRef } from 'react';
import useLoadedEnd from '../../base/useLoadedEnd';
import './index.scss';
import Adsorption from '../../base/Adsorption';
import useObserverBorderScroll from '../../base/useObserverBorderScroll';

const prefixClass = "yy-detail-view";

const Detail: React.FC = () => {
  // temp: 背景图片
  const [ styles, setStyles ] = useState({
    filter: `blur(0px)`,
    backgroundImage: `url(${'https://unsplash.it/1920/1080?random'})`
  });
  const detailRef = useRef<HTMLDivElement>(null);

  const handleScroll = (distance: number) => {
    let blur = distance / 100
    if (blur > 2) {
      blur = 2
    }
    setStyles({
      filter: `blur(${blur}px)`,
      backgroundImage: `url(${'https://unsplash.it/1920/1080?random'})`
    })
  }

  useLoadedEnd();

  useObserverBorderScroll(detailRef, handleScroll)

  return (
    <div className={`${prefixClass}`} ref={detailRef}>
      {/* 封面图 */}
      <div
        className={`${prefixClass}-cover`}
        style={styles}
      />
      <div>
        {/* 标题 */}
        <Adsorption>
          <h1 className={`${prefixClass}-title`}>ヱヴァンゲリヲン</h1>
        </Adsorption>
        {/* 创作时间 */}
        <p className={`${prefixClass}-date`}>2077-01-01 17:30:00</p>
        {/* 内容 */}
        <div className={`${prefixClass}-content`}>
          故事描述的是一个有关“第二次冲击”的记事。公元2000年有颗巨大的陨石坠落在南极冰山附近，高温造成部分冰块溶化，连带使得全球水位上涨，接下来的天灾人祸更是连绵不断，公元2015年又出现了新的入侵者，一种似人的巨大机械战斗群，人们将之称为”使徒”，大概是影射他们是上帝派来的使者，要来消灭作恶多端的人类吧。人类此刻的各种军事武器对使徒可说是毫无用处，为此，当时地球的政治中心决定重用NERV这个组织，他们以最精密的技术，花费巨资研究出一种以驾驶员的神经直接控制的”泛用人形决战兵器”，这种高科技产物将驾驶员与机器做了精细的契合，籍由意志及身体的反映来控制EVA。不过由于当时这些技术还在研发阶段，所以有许多障碍还无法立即克服。而且因为并不是每个人都能自由的驾驶EVA。驾驶人选一直是NERV最头疼的地方，除了符合条件的人难觅，而且还必须经过几个月训练才能和EVA达到同步活动的基本能力。而后，在世界上发现了3名可以驾驶EVA的少男少女，人们把希望都寄托在了他们身上。
          <br/>
          淡蓝色的头发，红色的眼眸。只爱食素的她就读于第三新东京市市立第一中学2年A班。 她是EVA第一适格者，零号机的专属驾驶员，驾驶零号机迎战使徒，真嗣母亲唯的半复制体，体内拥有着第二使徒莉莉丝的灵魂。
          <br/>
          故事描述的是一个有关“第二次冲击”的记事。公元2000年有颗巨大的陨石坠落在南极冰山附近，高温造成部分冰块溶化，连带使得全球水位上涨，接下来的天灾人祸更是连绵不断，公元2015年又出现了新的入侵者，一种似人的巨大机械战斗群，人们将之称为”使徒”，大概是影射他们是上帝派来的使者，要来消灭作恶多端的人类吧。人类此刻的各种军事武器对使徒可说是毫无用处，为此，当时地球的政治中心决定重用NERV这个组织，他们以最精密的技术，花费巨资研究出一种以驾驶员的神经直接控制的”泛用人形决战兵器”，这种高科技产物将驾驶员与机器做了精细的契合，籍由意志及身体的反映来控制EVA。不过由于当时这些技术还在研发阶段，所以有许多障碍还无法立即克服。而且因为并不是每个人都能自由的驾驶EVA。驾驶人选一直是NERV最头疼的地方，除了符合条件的人难觅，而且还必须经过几个月训练才能和EVA达到同步活动的基本能力。而后，在世界上发现了3名可以驾驶EVA的少男少女，人们把希望都寄托在了他们身上。
          <br/>
          故事描述的是一个有关“第二次冲击”的记事。公元2000年有颗巨大的陨石坠落在南极冰山附近，高温造成部分冰块溶化，连带使得全球水位上涨，接下来的天灾人祸更是连绵不断，公元2015年又出现了新的入侵者，一种似人的巨大机械战斗群，人们将之称为”使徒”，大概是影射他们是上帝派来的使者，要来消灭作恶多端的人类吧。人类此刻的各种军事武器对使徒可说是毫无用处，为此，当时地球的政治中心决定重用NERV这个组织，他们以最精密的技术，花费巨资研究出一种以驾驶员的神经直接控制的”泛用人形决战兵器”，这种高科技产物将驾驶员与机器做了精细的契合，籍由意志及身体的反映来控制EVA。不过由于当时这些技术还在研发阶段，所以有许多障碍还无法立即克服。而且因为并不是每个人都能自由的驾驶EVA。驾驶人选一直是NERV最头疼的地方，除了符合条件的人难觅，而且还必须经过几个月训练才能和EVA达到同步活动的基本能力。而后，在世界上发现了3名可以驾驶EVA的少男少女，人们把希望都寄托在了他们身上。
          <br/>
          故事描述的是一个有关“第二次冲击”的记事。公元2000年有颗巨大的陨石坠落在南极冰山附近，高温造成部分冰块溶化，连带使得全球水位上涨，接下来的天灾人祸更是连绵不断，公元2015年又出现了新的入侵者，一种似人的巨大机械战斗群，人们将之称为”使徒”，大概是影射他们是上帝派来的使者，要来消灭作恶多端的人类吧。人类此刻的各种军事武器对使徒可说是毫无用处，为此，当时地球的政治中心决定重用NERV这个组织，他们以最精密的技术，花费巨资研究出一种以驾驶员的神经直接控制的”泛用人形决战兵器”，这种高科技产物将驾驶员与机器做了精细的契合，籍由意志及身体的反映来控制EVA。不过由于当时这些技术还在研发阶段，所以有许多障碍还无法立即克服。而且因为并不是每个人都能自由的驾驶EVA。驾驶人选一直是NERV最头疼的地方，除了符合条件的人难觅，而且还必须经过几个月训练才能和EVA达到同步活动的基本能力。而后，在世界上发现了3名可以驾驶EVA的少男少女，人们把希望都寄托在了他们身上。
          <br/>
          故事描述的是一个有关“第二次冲击”的记事。公元2000年有颗巨大的陨石坠落在南极冰山附近，高温造成部分冰块溶化，连带使得全球水位上涨，接下来的天灾人祸更是连绵不断，公元2015年又出现了新的入侵者，一种似人的巨大机械战斗群，人们将之称为”使徒”，大概是影射他们是上帝派来的使者，要来消灭作恶多端的人类吧。人类此刻的各种军事武器对使徒可说是毫无用处，为此，当时地球的政治中心决定重用NERV这个组织，他们以最精密的技术，花费巨资研究出一种以驾驶员的神经直接控制的”泛用人形决战兵器”，这种高科技产物将驾驶员与机器做了精细的契合，籍由意志及身体的反映来控制EVA。不过由于当时这些技术还在研发阶段，所以有许多障碍还无法立即克服。而且因为并不是每个人都能自由的驾驶EVA。驾驶人选一直是NERV最头疼的地方，除了符合条件的人难觅，而且还必须经过几个月训练才能和EVA达到同步活动的基本能力。而后，在世界上发现了3名可以驾驶EVA的少男少女，人们把希望都寄托在了他们身上。
        </div>
      </div>
    </div>
  );
}

export default Detail;
